name: "echo-json"
max_batch_size: 0
backend: "python"

input [
    {
        name: "config:json"
        data_type: TYPE_UINT8
        dims: [ -1 ]
    }
]

output [
    {
        name: "response:json"
        data_type: TYPE_UINT8
        dims: [ -1 ]
    }
]

instance_group [
    {
      count: 1
      kind: KIND_CPU
    }
]